promptflow/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_current_user
    if session[:user_id]
      Current.user = User.find_by(id: session[:user_id])