promptflow/app/controllers/badfeedback_controller.rb

SELECT "prompt_sessions".* FROM "prompt_sessions" WHERE "prompt_sessions"."uid" = ? LIMIT ?  [["uid", 1], ["LIMIT", 1]]
INSERT INTO "bad_feedbacks" ("prompt_session_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["prompt_session_id", 1], ["comment", "Negative service, I don't like it"], ["created_at", "2025-03-23 15:34:58.956398"], ["updated_at", "2025-03-23 15:34:58.956398"]]
---
  def get_feedback
    @bf = BadFeedback.new(get_params)
    @ps = PromptSession.find_by(uid: get_params[:prompt_session_id])
    if @ps
      @ps.dislike_count = @ps.dislike_count + 1
      @bf.comment = get_params[:comment]
      @bf.save