promptflow/app/controllers/goodfeedback_controller.rb

  def get_feedback
    @gf = GoodFeedback.new(get_params)
    @ps = PromptSession.find_by(uid: get_params[:prompt_session_id])
    if @ps
      @ps.like_count = @ps.like_count + 1
      @gf.comment = get_params[:comment]
      @gf.save
---
SELECT "prompt_sessions".* FROM "prompt_sessions" WHERE "prompt_sessions"."uid" = ? LIMIT ?  [["uid", 1], ["LIMIT", 1]]
INSERT INTO "good_feedbacks" ("prompt_session_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["prompt_session_id", 1], ["comment", "AAAAAAAAA."], ["created_at", "2025-03-23 14:31:50.540119"], ["updated_at", "2025-03-23 14:31:50.540119"]]