promptflow/app/controllers/promptsession_controller.rb

  def set_prompt
    @ps = PromptSession.new(prompt_params)
    @ps.like_count = 0
    @ps.dislike_count = 0
    @ps.user_id = Current.user.id
    if @ps.save
---
INSERT INTO "prompt_sessions" ("uid", "system_prompt", "like_count", "dislike_count", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"