promptflow/app/controllers/promptsession_controller.rb

SELECT "prompt_sessions".* FROM "prompt_sessions" WHERE "prompt_sessions"."uid" = ? LIMIT ?  [["uid", 1], ["LIMIT", 1]]
---
  def get_prompt
    @ps = PromptSession.find_by(uid: params[:uid])

SELECT "prompt_sessions".* FROM "prompt_sessions" WHERE "prompt_sessions"."uid" = ? LIMIT ?  [["uid", 1], ["LIMIT", 1]]
UPDATE "prompt_sessions" SET "system_prompt" = ?, "feedback" = ?, "prompt_sim" = ?, "updated_at" = ? WHERE "prompt_sessions"."id" = ?  [["system_prompt", "You are a customer service agent struggling to meet performance standards.  \n"], ["feedback", nil], ["prompt_sim", nil], ["updated_at", "2025-03-23 17:48:56.449982"], ["id", 1]]
---
  def change
    @ps = PromptSession.find_by(uid: params[:id])
    if @ps
      puts "AAAAAAAAAAAAAAAAAAA"
      temp = @ps.feedback
      @ps.system_prompt = temp
      @ps.prompt_sim = nil
      @ps.feedback = nil
      @ps.save

INSERT INTO "prompt_sessions" ("uid", "system_prompt", "like_count", "dislike_count", "feedback", "prompt_sim", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def set_prompt
    @ps = PromptSession.new(prompt_params)
    @ps.like_count = 0
    @ps.dislike_count = 0
    @ps.user_id = Current.user.id
    if @ps.save

SELECT "prompt_sessions".* FROM "prompt_sessions" WHERE "prompt_sessions"."uid" = ? LIMIT ?  [["uid", 123], ["LIMIT", 1]]
---
  def update_prompt
    @ps = PromptSession.find_by(uid: uprompt_params[:uid])