promptflow/app/views/main/home.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    // Sample prompt data
    var promptData = [
      <% if Current.user %>
      <% @pss.each do |prompt| %>
      {
        id: <%= @i %>,
        uid: <%= prompt.uid %>,
        title: "<%= prompt.system_prompt != nil ? prompt.system_prompt.strip : " " %>",
        date: "<%= prompt.updated_at %>",
        content: "<%= prompt.system_prompt != nil ? prompt.system_prompt.strip : " " %>",
        likes: <%= prompt.like_count %>,
        dislikes: <%= prompt.dislike_count %>,
        feedback: "<%= prompt.feedback != nil ? prompt.feedback.strip : " " %>",
        simi: "<%= prompt.prompt_sim %>"
      },
      <% @i = @i + 1%>
      <%end%>

      <% else %>

      <% end %>
    ];